[
    {
        "title": "Python Syntax",
        "img": "https://cdn.britannica.com/28/239528-050-D89C8118/reticulated-python-Malayopython-reticulatus.jpg",
        "contents": [
            {
                "tag": "p",
                "content": "Execute Python Syntax\nAs we learned in the previous page, Python syntax can be executed by writing directly in the Command Line:"
            },
            {
                "tag": "code",
                "content": ">>> print(\"Hello, World!\")\nHello, World!"
            },
            {
                "tag": "p",
                "content": "by creating a python file on the server, using the .py file extension, and running it in the Command Line:"
            },
            {
                "tag": "code",
                "content": "C:\\Users\\Your Name>python myfile.py"
            },
            {
                "type": "h1",
                "content": "Python Indentation"
            },
            {
                "type": "p",
                "content": "Indentation refers to the spaces at the beginning of a code line.\"Indentation refers to the spaces at the beginning of a code line.\n\nWhere in other programming languages the indentation in code is for readability only, the indentation in Python is very important.\n\nPython uses indentation to indicate a block of code."
            },
            {
                "type": "code",
                "content": "if 5 > 2:\n  print(\"Five is greater than two!\")\n"
            },
            {
                "type": "p",
                "content": "Python will give you an error if you skip the indentation:\"Python will give you an error if you skip the indentation:"
            },
            {
                "type": "code",
                "content": "if 5 > 2:\nprint(\"Five is greater than two!\")\n"
            },
            {
                "type": "p",
                "content": "The number of spaces is up to you as a programmer, the most common use is four, but it has to be at least one.\"The number of spaces is up to you as a programmer, the most common use is four, but it has to be at least one."
            },
            {
                "type": "code",
                "content": "if 5 > 2:\n     print(\"Five is greater than two!\") \nif 5 > 2:\n     print(\"Five is greater than two!\") \n"
            },
            {
                "type": "p",
                "content": "You have to use the same number of spaces in the same block of code, otherwise Python will give you an error:\"You have to use the same number of spaces in the same block of code, otherwise Python will give you an error:"
            },
            {
                "type": "code",
                "content": "if 5 > 2:\n    print(\"Five is greater than two!\")\n"
            },
            {
                "type": "h1",
                "content": "Python Variables"
            },
            {
                "type": "p",
                "content": "In Python, variables are created when you assign a value to it:\"In Python, variables are created when you assign a value to it:"
            },
            {
                "type": "code",
                "content": "x = 5\ny = \"Hello, World!\"\n"
            },
            {
                "type": "h1",
                "content": "Comments"
            },
            {
                "type": "p",
                "content": "Python has commenting capability for the purpose of in-code documentation.\"Python has commenting capability for the purpose of in-code documentation.\n\nComments start with a #, and Python will render the rest of the line as a comment:"
            },
            {
                "type": "code",
                "content": "#This is a comment.\nprint(\"Hello, World!\")\n"
            },
            {
                "type": "h1",
                "content": "This is a comment."
            }
        ]
    }
]
